Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization Methods
The ModelObjectVisualization type exposes the following members.
Methods
Name | Description
ClearAllTemporaryStates
 Clears temporary visualization from all model objects and restores permanent representation.
ClearTemporaryStates
 Clears temporary visualization from model objects and restores permanent representation.
GetAllTemporaryColored
 Gets all temporary colored objects and their color
GetRepresentation
 Gets current permanent representation (red, blue, green and transparency) of given model object
GetTempRepresentation
 Gets the temporary representation (red, blue, green and transparency) of given model object
SetTemporaryState(List<Identifier>, Color)
 Sets visualization temporary state (red, blue, green and transparency) for given model object identifiers
SetTemporaryState(List<ModelObject>, Color)
 Sets visualization temporary state (red, blue, green and transparency) for given model objects
SetTemporaryStateForAll
 Sets temporary visualization state (red, blue, green and transparency) for all model objects
SetTransparency(List<Identifier>, TemporaryTransparency)
 Restores permanent representation settings and sets temporary transparency for given model object identifiers
SetTransparency(List<ModelObject>, TemporaryTransparency)
 Restores permanent representation settings and sets temporary transparency for given model objects
SetTransparencyForAll
 Restores permanent representation settings and sets temporary transparency for all model objects
SetVisibility
 Sets visibility for given model objects.
UnhideParts
 Unide all parts in the model.
Top
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace